Repository: TrainerSnow/GradePlannerApplication
Catalog: grade_planner/lib/l10n/app_*.arb
Languages: de

# app_name
source: Grade Planner
de: Notenplaner

source: Add Year
de: Klasse hinzufügen

source: Add Subject
de: Fach hinzufügen

source: Add Grade
de: Note hinzufügen

source: Year
de: Klasse

source: Year name
de: Klassenname

source: Subject
de: Fach

source: Group
de: Gruppe

source: Groups
de: Gruppen

source: Subject name
de: Fachname

source: Group name
de: Gruppenname

source: Grade name
de: Notenname

source: Grade value
de: Notenwert

source: Grade Ordering
de: Notensortierung

source: Value
de: Wert

source: Days ago
de: Vor Tagen

source: Grades
de: Noten

# percentage_part
source: Percentage
de: Prozentanteil

source: Average
de: Durchschnitt

source: Confirm
de: Bestätigen

source: Cancel
de: Abbrechen

source: Send
de: Senden

source: Add
de: Hinzufügen

source: Add photo
de: Bild hinzufügen

source: Show more
de: Mehr

source: Show less
de: Weniger

source: Confirm Deletion
de: Löschen bestätigen

source: Error
de: Warnung

source: View all subjects
de: Alle Fächer ansehen

# grades_in_x
source: Grades in %s
de: Noten in %s

# images_in_x
source: Images in %s
de: Bilder in %s

source: Current year:
de: Aktuelle Klasse:

source: [No year selected]
de: [Keine Klasse ausgewählt]

source: Select year
de: Klasse auswählen

# total_avg_grade_
source: Total average grade:
de: Totaler Durchschnitt:

source: [No data available]
de: [Keine Daten verfügbar]

source: Recently changed
de: Letztens geändert

# no_subject_data_info
source: No subject data found. Try adding some.
de: Keine Fächerdaten gefunden. Versuche, Fächer hinzuzufügen.

# no_grade_data_found
source: [No grade data found. Try adding grades.]
de: Keine Notendaten gefunden. Versuche, Noten hinzuzufügen.

# no_images_found
source: No images for this grade found.
de: Keine Bilder für diese Note gefunden.

# add_image_not_supported_info
source: Adding images is not supported on your platform. Please use a mobile device.
de: Bilder hinzuzufügen wird auf diesem Gerät nicht unterstützt. Bitte nutze ein mobiles Gerät.

# order_low_good
source: Low Values = Good
de: Tiefe Werte Gut, Hohe Werte Schlecht

# order_low_bad
source: Low Value = Bad
de: Hohe Werte Gut, Tiefe Werte Schlecht

# deletion_subject_x_info
source: Do you really want to delete the Subject '%s'? Note: This will delete all contained Groups and Grades. You cannot restore this. This deletion is permanent.
de: Willst du das Fach '%s' wirklich löschen? Achtung: Dies wird alle gruppen und Noten in diesem Fach löschen. Diese Aktion ist nicht widerrufbar.

# deletion_grade_x_info
source: Do you really want to delete the Grade '%s'? Note: This will delete all contained Groups and Grades. You cannot restore this. This deletion is permanent.
de: Willst du wirklich die Note '%s' löschen? Achtung: Dies löscht auch alle Bilder dieser Note. Diese Aktion ist nicht widerrufbar.

source: No recent activity
de: Keine kürzlichen Aktivitäten

# subject_not_found
source: Subject with that name was not found.
de: Kein Fach wurde mit diesem Name gefunden.

# group_not_found
source: Group was not found in that subject.
de: Diese Gruppe wurde in dem Fach nicht gefunden.

# grade_name_invalid
source: The grade name is invalid.
de: Der Notenname ist nicht zulässig.

# grade_name_exists
source: The grade name already exists in this group
de: Der Notenname existiert bereits in dieser Gruppe.

# grade_value_invalid
source: The grade value is invalid
de: Der Notenwert is unzulässig.

# subject_name_exists
source: Subject name alr exists.
de: Der Fachname existiert bereits.

# parts_not_add_up
source: The values don't add up to 100.
de: Die Werte ergeben nicht 100.

# names_invalid
source: The names are invalid.
de: Die Namen sind unzulässig.

# duplicate_names
source: Only specify each grade group name once.
de: Gebe jeden Gruppennamen nur einmal an.

# parts_unfilled
source: Please fill out all part values
de: Bitte fülle alle Prozentangaben aus.

# year_name_exists
source: Year name already exists.
de: Klassenname existiert bereits.

# year_name_invalid
source: Year name is invalid
de: Klassenname ist unzulässig.
